# US Home Price Prediction

## Reading Data

In [1]:
import numpy as np
import pandas as pd

In [71]:
gdp = pd.read_csv("Data/gdp.csv")
immig = pd.read_csv("Data/immigrants.csv")
infl = pd.read_csv("Data/inflation.csv")
mrtg = pd.read_csv("Data/mortgage.csv")
ppl = pd.read_csv("Data/population.csv")
unemp = pd.read_csv("Data/unemployment.csv")
median = pd.read_csv("Data/median.csv")
avg = pd.read_csv("Data/average.csv")
cs = pd.read_csv("Data/cs-shi.csv")

In [6]:
print(gdp.shape, immig.shape, infl.shape, ppl.shape, unemp.shape, median.shape, avg.shape, cs.shape)

(20, 3) (19, 2) (20, 2) (20, 2) (20, 2) (20, 2) (80, 2) (240, 2)

## GDP

In [72]:
gdp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   date            20 non-null     object
 1   gdp_billion     20 non-null     float64
 2   gdp_per_capita  20 non-null     float64
dtypes: float64(2), object(1)
memory usage: 608.0+ bytes

In [73]:
gdp['date'] = pd.to_datetime(gdp['date'])

C:\Users\tailw\AppData\Local\Temp\ipykernel_19072\2576662707.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  gdp['date'] = pd.to_datetime(gdp['date'])

In [74]:
gdp.head()

        date  gdp_billion  gdp_per_capita
0 2003-12-31  11456.44204      39490.2750
1 2004-12-31  12217.19320      41724.6316
2 2005-12-31  13039.19919      44123.4071
3 2006-12-31  13815.58695      46302.0009
4 2007-12-31  14474.22691      48050.2238

In [14]:
gdp['year'] = gdp['date'].dt.year
gdp['month'] = gdp['date'].dt.month
gdp['day'] = gdp['date'].dt.day

In [21]:
gdp.head()

   gdp_billion  gdp_per_capita  year
0  11456.44204      39490.2750  2003
1  12217.19320      41724.6316  2004
2  13039.19919      44123.4071  2005
3  13815.58695      46302.0009  2006
4  14474.22691      48050.2238  2007

In [18]:
gdp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   gdp_billion     20 non-null     float64
 1   gdp_per_capita  20 non-null     float64
 2   year            20 non-null     int32
 3   month           20 non-null     int32
dtypes: float64(2), int32(2)
memory usage: 608.0 bytes

In [17]:
gdp.drop(columns=['date', 'day'], inplace=True)

In [20]:
gdp.drop(columns=['month'], inplace=True)

In [23]:
gdp.to_csv('gdp.csv', index=False, header=True)

## Case Shiller

In [41]:
cs.head()

         date       cs
0  01-01-2003  128.461
1  01-02-2003  129.355
2  01-03-2003  130.148
3  01-04-2003  130.884
4  01-05-2003  131.734

In [50]:
cs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    240 non-null    datetime64[ns]
 1   cs      240 non-null    float64
 2   year    240 non-null    int32
 3   month   240 non-null    int32
dtypes: datetime64[ns](1), float64(1), int32(2)
memory usage: 5.8 KB

In [48]:
cs['date'] = pd.to_datetime(cs['date'], format='%d-%m-%Y')

In [49]:
cs['year'] = cs['date'].dt.year
cs['month'] = cs['date'].dt.month

In [54]:
cs.head()

        cs  year  month
0  128.461  2003      1
1  129.355  2003      2
2  130.148  2003      3
3  130.884  2003      4
4  131.734  2003      5

In [52]:
cs.drop(columns=['date'], inplace=True)

In [55]:
cs.to_csv('case-shiller.csv', index=False, header=True)

## Inflation

In [56]:
infl.head()

         date  inf_rate
0  31-12-2003    2.2701
1  31-12-2004    2.6772
2  31-12-2005    3.3927
3  31-12-2006    3.2259
4  31-12-2007    2.8527

In [57]:
infl['date'] = pd.to_datetime(infl['date'], format='%d-%m-%Y')

In [58]:
infl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      20 non-null     datetime64[ns]
 1   inf_rate  20 non-null     float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 448.0 bytes

In [59]:
infl['year'] = infl['date'].dt.year

In [63]:
infl.head()

   inf_rate  year
0    2.2701  2003
1    2.6772  2004
2    3.3927  2005
3    3.2259  2006
4    2.8527  2007

In [62]:
infl.drop(columns=['date'], inplace=True)

In [64]:
infl.to_csv('inflation.csv', header=True, index=False)

## Median House Price

In [76]:
median.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    20 non-null     object
 1   median  20 non-null     int64
dtypes: int64(1), object(1)
memory usage: 448.0+ bytes

In [77]:
median['year'] = pd.to_datetime(median['date'], format='%d-%m-%Y').dt.year

In [78]:
median.head()

         date  median  year
0  01-01-2003   65860  2003
1  01-01-2004   65760  2004
2  01-01-2005   66780  2005
3  01-01-2006   67520  2006
4  01-01-2007   68610  2007

In [79]:
median.drop(columns=['date'], inplace=True)

In [70]:
median.to_csv('median.csv', header=True, index=False)

## Average House Price

In [85]:
avg.head()

        date     avg  year  month
0 2003-01-01  233100  2003      1
1 2003-04-01  241000  2003      4
2 2003-07-01  248100  2003      7
3 2003-10-01  256000  2003     10
4 2004-01-01  262900  2004      1

In [83]:
avg['date'] = pd.to_datetime(avg['date'], format='%d-%m-%Y')

In [84]:
avg['year'] = avg['date'].dt.year
avg['month'] = avg['date'].dt.month

In [86]:
avg.drop(columns=['date'], inplace=True)

In [87]:
avg.to_csv('average.csv', header=True, index=False)

## Mortgage

In [93]:
mrtg.head()

   mortgage  year  month  day
0      5.85  2003      1    3
1      5.95  2003      1   10
2      5.97  2003      1   17
3      5.91  2003      1   24
4      5.90  2003      1   31

In [89]:
mrtg['date'] = pd.to_datetime(mrtg['date'], format='%d-%m-%Y')
mrtg['year'] = mrtg['date'].dt.year
mrtg['month'] = mrtg['date'].dt.month
mrtg['day'] = mrtg['date'].dt.day

In [92]:
mrtg.drop(columns=['date'], inplace=True)

In [94]:
mrtg.to_csv('mortgage.csv', header=True, index=False)

## Population

In [99]:
ppl.head()

    population  year
0    291109820  2003
1    293947885  2004
2    296842670  2005
3    299753098  2006
4    302743399  2007

In [97]:
ppl['date'] = pd.to_datetime(ppl['date'], format='%d-%m-%Y')
ppl['year'] = ppl['date'].dt.year

In [98]:
ppl.drop(columns=['date'], inplace=True)

In [100]:
ppl.to_csv('population.csv', header=True, index=False)

## Unemployment

In [107]:
unemp.head()

   unemp_rate  year
0        5.99  2003
1        5.53  2004
2        5.08  2005
3        4.62  2006
4        4.62  2007

In [104]:
unemp['date'] = pd.to_datetime(unemp['date'], format='%d-%m-%Y')
unemp['year'] = unemp['date'].dt.year

In [106]:
unemp.drop(columns=['date'], inplace=True)

In [108]:
unemp.to_csv('unemployment.csv', header=True, index=False)